thmalmeida/STM32F10y/src/main.cpp
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "acionna.h"
#include "loadCell.h"
#include <time.h>
#include <stm32f10x.h>
#include <stm32f10x_rtc.h>
#include "stm32f10x_it.h"
#include "Hardware/adc.h"

#include "nokia5110/nokia5110.h"
#include "nokia5110/fonts/fonts.h"

ACIONNA acn;
ADC convert;

LOADCELL weight1;
LOADCELL weight2;
LOADCELL weight3;
LOADCELL weight4;

NOKIA5110 glcd;

// Wake up interrupts
//uint8_t flag_WDRF = 0;			// Watchdog System Reset Flag
//uint8_t flag_BORF = 0;			// Brown-out Reset Flag
//uint8_t flag_EXTRF = 0;			// External Reset Flag
//uint8_t flag_PORF = 0;			// Power-on Reset Flag
//uint16_t var = 0x0003;
int P[5];
uint8_t mode = 0;
void showResults()
{
	P[0] = P[1]+P[2]+P[3]+P[4];

	switch (mode)
	{
		case 0:	// kilogram digit only
			sprintf(Serial.buffer,"%5.1d", P[0]/1000);			// 0 digitos;
			glcd.glcd_Arial16x24_str(4,1,Serial.buffer);
			glcd.glcd_put_string(72,5,"kg");					// unit print;
			break;
		case 1:	// kilogram digit and decimal floating point
			if(P[0]/100%10 < 0)
			{
				if((P[0]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");					// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[0])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[0]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[0]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;
			break;
		case 2:	// All weights with 2 decimal floating point
			sprintf(Serial.buffer,"Pt: %7.1d.%.2d", P[0]/1000, (P[0]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,1,Serial.buffer);

			sprintf(Serial.buffer,"P1: %7.1d.%.2d", P[1]/1000, abs(P[1]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,2,Serial.buffer);

			sprintf(Serial.buffer,"P2: %7.1d.%.2d", P[2]/1000, abs(P[2]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,3,Serial.buffer);

			sprintf(Serial.buffer,"P3: %7.1d.%.2d", P[3]/1000, abs(P[3]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,4,Serial.buffer);

			sprintf(Serial.buffer,"P4: %7.1d.%.2d", P[4]/1000, abs(P[4]/10)%100);	// 2 digitos;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s%d", mode);						// mode print;
			glcd.glcd_put_string(72,0,Serial.buffer);
			break;
		case 3:	// Sensor 1 debugging
		{
			if(P[1]/100%10 < 0)
			{
				if((P[1]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[1])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[1]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[1]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(Serial.buffer,"o: %8d", weight1.offset);		// offset show;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s: %8d", weight1.signal);		// signal show;
			glcd.glcd_put_string(0,0,Serial.buffer);

			sprintf(Serial.buffer,"s%d", 1);						// mode print;
			glcd.glcd_put_string(72,0,Serial.buffer);
		}
		break;
		case 4:	// Sensor 2 debugging
		{
			if(P[2]/100%10 < 0)
			{
				if((P[2]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[2])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[2]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[2]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(Serial.buffer,"o: %8d", weight2.offset);		// offset show;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s: %8d", weight2.signal);		// signal show;
			glcd.glcd_put_string(0,0,Serial.buffer);

			sprintf(Serial.buffer,"s%d", 2);						// mode print;
			glcd.glcd_put_string(72,0,Serial.buffer);
		}
		break;
		case 5:	// Sensor 3 debugging
		{
			if(P[3]/100%10 < 0)
			{
				if((P[3]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[3])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[3]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[3]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(Serial.buffer,"o: %8d", weight3.offset);		// offset show;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s: %8d", weight3.signal);		// signal show;
			glcd.glcd_put_string(0,0,Serial.buffer);

