thmalmeida/STM32F10y/src/main.cpp
			sprintf(Serial.buffer,"s%d", 3);						// mode print;
			glcd.glcd_put_string(72,0,Serial.buffer);
		}
		break;
		case 6:	// Sensor 4 debugging
		{
			if(P[4]/100%10 < 0)
			{
				if((P[4]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[4])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[4]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[4]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(Serial.buffer,"o: %8d", weight4.offset);		// offset show;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s: %8d", weight4.signal);		// signal show;
			glcd.glcd_put_string(0,0,Serial.buffer);

			sprintf(Serial.buffer,"s%d", 4);						// mode print;
			glcd.glcd_put_string(72,0,Serial.buffer);
		}
		break;
		case 7: // Small Sensor 1 debugging
		{
			if(P[1]/100%10 < 0)
			{
				if((P[1]/1000) == 0)
				{
					glcd.glcd_dot_print(35,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(35,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[1])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[1]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(4,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[1]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5," g");						// unit print;

			sprintf(Serial.buffer,"o: %8d", weight1.offset);		// offset show;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s: %8d", weight1.signal);		// signal show;
			glcd.glcd_put_string(0,0,Serial.buffer);

			glcd.glcd_put_string(72,0,"sm");
		}
			break;
//		case 6:
////			P[0] = P[1]+P[2]+P[3]+P[4];
//
//			sprintf(Serial.buffer,"Pt: %7.1d.%.1d", abs(P[0])/1000, abs(P[0])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,1,Serial.buffer);
//
//			sprintf(Serial.buffer,"P1: %7.1d.%.1d", abs(P[1])/1000, abs(P[1])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,2,Serial.buffer);
//
//			sprintf(Serial.buffer,"P2: %7.1d.%.1d", abs(P[2])/1000, abs(P[2])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,3,Serial.buffer);
//
//			sprintf(Serial.buffer,"P3: %7.1d.%.1d", abs(P[3])/1000, abs(P[3])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,4,Serial.buffer);
//
//	//		sprintf(Serial.buffer,"P4: %7.1d", P[4]);				// whole digits in GRAMS [g];
//			sprintf(Serial.buffer,"P4: %7.1d.%.1d", abs(P[4])/1000, abs(P[4])/100%10);			// 1 digitos;
//			glcd.glcd_put_string(0,5,Serial.buffer);
//
//			sprintf(Serial.buffer,"s%d", mode);						// mode print;
//			glcd.glcd_put_string(72,0,Serial.buffer);
//			break;
//		case 7: // the whole weight
////			P[0] = P[1]+P[2]+P[3]+P[4];
//
//			weight1.offset = 11500;
//			weight2.offset = 5000;
//			weight3.offset = 11500;
//			weight4.offset = 11500;
//
//			static const int index = 0;
//
//			if(P[index]/100%10 < 0)
//			{
//				if((P[0]/1000) == 0)
//				{
//					glcd.glcd_dot_print(35,2,9,0xC0);				// minus signal;
//					glcd.glcd_dot_print(35,3,9,0x01);				// minus signal;
//					glcd.glcd_Arial16x24_str(52,1,"0");				// 0 digitos;
//				}
//
//				sprintf(Serial.buffer,"%.1d", abs(P[index])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
//				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
//
//			}
//			else
//			{
//				sprintf(Serial.buffer,"%4.1d", P[index]/1000);		// 0 digitos;
//				glcd.glcd_Arial16x24_str(4,1,Serial.buffer);
//
//				sprintf(Serial.buffer,"%.1d", P[index]/100%10);		// 1 digitos; divide by centesimum part and use 10 by 10.
//				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
//			}
//			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
//			glcd.glcd_put_string(72,5,"kg");						// unit print;
//
//			sprintf(Serial.buffer,"o: %8d", weight1.offset);		// offset show;
//			glcd.glcd_put_string(0,5,Serial.buffer);
//
//			sprintf(Serial.buffer,"s: %8d", weight1.signal);		// signal show;
//			glcd.glcd_put_string(0,0,Serial.buffer);
//
//			sprintf(Serial.buffer,"s%d", mode);						// mode print;
//			glcd.glcd_put_string(72,0,Serial.buffer);
//			break;
//		case 8:
//			sprintf(Serial.buffer,"%.1d.%.2d   %.1d.%.2d", P[1]/1000, abs(P[1]/10)%100, P[2]/1000, abs(P[2]/10)%100);	// 2 digitos;
//			glcd.glcd_put_string(0,0,Serial.buffer);
//			sprintf(Serial.buffer,"%.1d.%.2d   %.1d.%.2d", P[3]/1000, abs(P[3]/10)%100, P[4]/1000, abs(P[4]/10)%100);	// 2 digitos;
//			glcd.glcd_put_string(0,1,Serial.buffer);
//
//			sprintf(Serial.buffer,"%d", weight1.signal);		// signal show;
//			glcd.glcd_put_string(0,2,Serial.buffer);
//			sprintf(Serial.buffer,"%d", weight1.offset);		// offset show;
//			glcd.glcd_put_string(46,2,Serial.buffer);
//
//			sprintf(Serial.buffer,"%d", weight2.signal);		// signal show;
//			glcd.glcd_put_string(0,3,Serial.buffer);
//			sprintf(Serial.buffer,"%d", weight2.offset);		// offset show;
//			glcd.glcd_put_string(46,3,Serial.buffer);
//
//			sprintf(Serial.buffer,"%d", weight3.signal);		// signal show;
//			glcd.glcd_put_string(0,4,Serial.buffer);
//			sprintf(Serial.buffer,"%d", weight3.offset);		// offset show;
//			glcd.glcd_put_string(46,4,Serial.buffer);
//
//			sprintf(Serial.buffer,"%d", weight4.signal);		// signal show;
//			glcd.glcd_put_string(0,5,Serial.buffer);
//			sprintf(Serial.buffer,"%d", weight4.offset);		// offset show;
//			glcd.glcd_put_string(46,5,Serial.buffer);
//
////				sprintf(Serial.buffer,"s%d", mode);						// mode print;
////				glcd.glcd_put_string(72,0,Serial.buffer);
//			break;
//		default:
////				sprintf(Serial.buffer,"%4.1d", abs(P[0])/1000);			// 1 digitos;
////				sprintf(Serial.buffer,"%3.1d.%.1d", abs(P[mode])/1000, abs(P[mode])/100%10);			// 1 digitos;
////				sprintf(Serial.buffer,"%3.1d.%.1d", abs(P[mode])/1000, abs(P[mode])/100%10);			// 1 digitos;
//
////				sprintf(Serial.buffer,"%.1d", abs(P[0])/100%10);		// 1 digitos;
////				sprintf(Serial.buffer,"%.2d", abs(P[0])/10%100);		// 2 digitos;
////				sprintf(Serial.buffer,"%.3d", abs(P[0])%1000);			// 3 digitos;
////				glcd.glcd_big_str(8,2,Serial.buffer);
//
//			sprintf(Serial.buffer,"%4.1d", abs(P[mode])/1000);			// 0 digitos;
//			glcd.glcd_Arial16x24_str(4,1,Serial.buffer);
//			glcd.glcd_dot_print(65,4,3,0x07);
//			sprintf(Serial.buffer,"%.1d", abs(P[mode])/100%10);		// 1 digitos;
//			glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
//
//			sprintf(Serial.buffer,"s%d", mode);
//			glcd.glcd_put_string(0,0,Serial.buffer);
//			glcd.glcd_put_string(72,5,"kg");
//		break;
	}
}

int main(void)
{
	init();							// uC basic peripherals setup

//	acn.begin_acn();				// Class acionna statement
//	Serial.begin(9600);				// Initialize USART1 @ 9600 baud
//	Serial.println("Acionna v2.0");
//	acn.blink_led(2, 150);
	rtc.begin_rtc(rtc.rtc_clkSource, rtc.rtc_PRL);	// must be after eeprom init to recover rtc.rtc_PRL on flash
	glcd.glcd_init(1);

//	int c = 0;
//	while(1)
//	{
//		sprintf(Serial.buffer, "%d", c);
//		glcd.glcd_put_string(0,0,Serial.buffer);
//		c++;
//	}

