thmalmeida/STM32F10y/src/main.cpp
	double A[5];
	A[0] = 1.0000;
	A[1] = 2.9997;
	A[2] = 3.0000;
	A[3] = 3.0017;
	A[4] = 3.0012;

	double Kc[5];
	Kc[0] = 10*1.3634;
	Kc[1] = 1.0872;
	Kc[2] = 1.6200;	// YZC-320 tested on 20170816 with 3.0mV/V and Kc = 1.6985;
	Kc[3] = 1.0872;	//10.33%
	Kc[4] = 1.0872;

	weight1.begin_loadcell(32, 31, A[1], Kc[1]);
	weight2.begin_loadcell(30, 29, A[2], Kc[2]);
	weight3.begin_loadcell(19, 18, A[3], Kc[3]);
	weight4.begin_loadcell(17, 16, A[4], Kc[4]);

	weight1.offset = 11500;
	weight2.offset = 5000;
	weight3.offset = 11500;
	weight4.offset = 11500;

	int count = 0;
	uint8_t tareOrder = 0;

	while(1)
	{
		P[1] = weight1.get_weight();
		P[2] = weight2.get_weight();
		P[3] = weight3.get_weight();
		P[4] = weight4.get_weight();

		count = 0;
		while(weight1.readTareButton())
		{
			count++;
			tareOrder = 1;

			if(count > 20)
			{
				tareOrder = 0;
				count = 0;
				mode++;
				if(mode == 7)
				{
					weight1.A = A[0];
					weight1.Kp = Kc[0];
				}
				if(mode>7)
				{
					mode = 0;
					weight1.A = A[1];
					weight1.Kp = Kc[1];

					weight2.A = A[2];
					weight2.Kp = Kc[2];

					weight3.A = A[3];
					weight3.Kp = Kc[3];

					weight4.A = A[4];
					weight4.Kp = Kc[4];
				}
				glcd.glcd_clear2();
				sprintf(Serial.buffer,"MODE %d", mode);			// 1 digitos;
				glcd.glcd_put_string(20,2,Serial.buffer);
				while(weight1.readTareButton());
				glcd.glcd_clear2();
			}
		}

		if(tareOrder)
		{
			tareOrder = 0;

			weight1.tareSystem3();
			weight2.tareSystem3();
			weight3.tareSystem3();
			weight4.tareSystem3();
			glcd.glcd_clear2();
		}

		if(acn.flag_1s == 1)
		{
			acn.flag_1s = 0;

			if(weight1.stable && weight2.stable && weight3.stable && weight4.stable)
			{
				showResults();
				weight1.drive_led(1);
			}
			else
			{
				weight1.drive_led(0);
			}
		}
//		sprintf(Serial.buffer,"%4.1d.%.2d", P/(weight.Waccu*10), abs(P%(weight.Waccu))/100);	// 2 digitos

//		sprintf(Serial.buffer,"P:%.3d.%.3d kg", abs(P/1000), abs(P)%1000);		// 3 digitos;
//		sprintf(Serial.buffer,"P:%.3d.%.2d kg", abs(P/1000), abs(P/10)%100);	// 2 digitos;
//		sprintf(Serial.buffer,"%.4d.%.1d", abs(P)/1000, abs(P)/100%10);			// 1 digitos;
//		glcd.glcd_put_string(0,2,Serial.buffer);

//		sprintf(Serial.buffer,"%4.1d", abs(P[0])/1000);		// kilogram digit;
//		glcd.glcd_Arial16x24_str(1,1,Serial.buffer);
//		glcd.glcd_dot_print(65,4,3);
//


//		acn.comm_Bluetooth();
//
//		acn.refreshVariables();
//
//		acn.handleMessage();
//
//		acn.process_Mode();
//		if(acn.flag_1s)
//		{
//			acn.flag_1s = 0;
//
//			rtc.getTime();
//			sprintf(buffer, "%s", ctime(&rtc.rawtime));
//			Serial.println(buffer);
//		}
	}
}

//int main(void)
//{
//	init();							// uC basic peripherals setup
//
//	acn.begin_acn();				// Class acionna statement
////	Serial.begin(9600);				// Initialize USART1 @ 9600 baud
////	Serial.println("Acionna v2.0");
//	acn.blink_led(2, 150);
//	weight.begin_loadcell();
//
////	char c='0';
////
////	while(1)
////	{
////		sprintf(Serial.buffer, "a: %c", c++);
////		Serial.println(Serial.buffer);
////		_delay_ms(500);
////	}
//
////	int c=10;
////	while(1)
////	{
////		sprintf(Serial.buffer,"%4.1d g", c);
////		glcd.glcd_big_str(0,0, Serial.buffer);
////		c++;
////		_delay_ms(500);
////	}
//
//	weight.example1();
//
//	while(1)
//	{
////		acn.comm_Bluetooth();
////
////		acn.refreshVariables();
////
////		acn.handleMessage();
////
////		acn.process_Mode();
//	}
//}

//const char * m()
//{
//    char * c = (char *)malloc(6 * sizeof(char));
//    c = "hello";
//    return (const char *)c;
//}
//
//int main(int argc, char * argv[])
//{
//    const char * d = m();
//    std::cout << d; // use PCSTR
//}


/*
 * Interruptions sequence
 */
extern "C" {
volatile int time_ms;
volatile int time_us;
volatile int count_1s = 1000000;
void SysTick_Handler(void)
{
	if(time_us)
		time_us--;

	if(time_ms)
		time_ms--;

	if(count_1s)
	{
		count_1s--;
	}
	else
	{
//		acn.flag_1s = 1;
		count_1s = 1000000;
	}
}
void RTC_IRQHandler(void)
{
	if(RTC->CRL & RTC_CRL_SECF)
	{
		RTC->CRL &= ~RTC_CRL_SECF;
		rtc.uptime32++;
		acn.flag_1s = 1;
	}
}
void USART1_IRQHandler(void)
{
	// check if the USART1 receive interrupt flag was set
	while(USART_GetITStatus(USART1, USART_IT_RXNE))
	{
//		GPIOC -> ODR ^= (1<<13);
		char t = (USART1->DR); // the character from the USART1 data register is saved in t

		if(Serial._USART1_cnt < MAX_STRLEN)
		{
			Serial._received_string[Serial._USART1_cnt] = t;
			Serial._USART1_cnt++;
		}
		else
		{
			memset(Serial._received_string,0,sizeof(Serial._received_string));
			Serial._USART1_cnt = 0;
		}
	}
}
void SPI1_IRQHandler(void)
{
#ifdef master
	//	static unsigned short int count = 0, i = 0 ;
	//	check if the SPI1 receive interrupt flag was set
	//	Master interrupt
	//	TX: 1- empty
	//	if(SPI1 -> SR & 0x0002)
		if(SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_TXE) == SET)
		{
			SerialSPI.SPI1_flag_rx = 1;
			SerialSPI.SPI1_rxd++;
			SerialSPI.SPI1_txd = SerialSPI.SPI1_rxd;
			SPI1 -> DR = SerialSPI.SPI1_txd;
	//		Wait until the data has been transmitted.
	//		while (!(SPI1->SR & SPI_I2S_FLAG_TXE));
	//		USART1_print("Transmitting: ");
	//		USART1_putc(0x40);
		}
//	//	if(SPI1 -> SR & SPI_I2S_FLAG_RXNE)
//		//	RX: 1- not empty
//	//	if(SPI1 -> SR & 0x0001)
		if(SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_RXNE) == SET)
		{
			SerialSPI.SPI1_flag_rx = 1;
			SerialSPI.SPI1_rxd = SPI1 -> DR;
			if(SerialSPI.SPI1_cnt < MAX_STRLEN)
			{
				SerialSPI.SPI_received_string[SerialSPI.SPI1_cnt] = SerialSPI.SPI1_rxd;
				SerialSPI.SPI1_cnt++;
			}
			else
			{
				memset(SerialSPI.SPI_received_string, 0, sizeof(SerialSPI.SPI_received_string));
				SerialSPI.SPI1_cnt = 0;
			}
		}

	//	if(SPI1 -> SR & 0x0100)
		if(SPI_I2S_GetITStatus(SPI1, SPI_IT_CRCERR))
		{
			SerialSPI.SPI1_flag_err = 1;
		}
#else
//	static unsigned short int count = 0, i = 0 ;
//	check if the SPI1 receive interrupt flag was set
//	Slave interrupt
//	TX: 1- empty
//	if(SPI1 -> SR & 0x0002)
	if(SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_TXE) == SET)
	{
		SerialSPI.SPI1_rxd++;
		SerialSPI.SPI1_txd = SerialSPI.SPI1_rxd;
		SPI1 -> DR = SerialSPI.SPI1_txd;
//		Wait until the data has been transmitted.
//		while (!(SPI1->SR & SPI_I2S_FLAG_TXE));
//		USART1_print("Transmitting: ");
//		USART1_putc(0x40);
	}
//	if(SPI1 -> SR & SPI_I2S_FLAG_RXNE)
	//	RX: 1- not empty
//	if(SPI1 -> SR & 0x0001)
	if(SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_RXNE) == SET)
	{
		SerialSPI.SPI1_flag_rx = 1;
		SerialSPI.SPI1_rxd = SPI1 -> DR;
		if(SerialSPI.SPI1_cnt < MAX_STRLEN)
		{
			SerialSPI.SPI_received_string[SerialSPI.SPI1_cnt] = SerialSPI.SPI1_rxd;
			SerialSPI.SPI1_cnt++;
		}
		else
		{
			memset(SerialSPI.SPI_received_string, 0, sizeof(SerialSPI.SPI_received_string));
			SerialSPI.SPI1_cnt = 0;
		}
	}

//	if(SPI1 -> SR & 0x0100)
	if(SPI_I2S_GetITStatus(SPI1, SPI_IT_CRCERR))
	{
		SerialSPI.SPI1_flag_err = 1;
	}
#endif
}
//void SPI2_IRQHandler(void)
//{
//#ifdef master
//	//	static unsigned short int count = 0, i = 0 ;
//	//	check if the SPI1 receive interrupt flag was set
//	//	Master interrupt
//	//	TX: 1- empty
//	//	if(SPI1 -> SR & 0x0002)
//		if(SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_TXE) == SET)
//		{
//			SerialSPI.SPI1_flag_rx = 1;
//			SerialSPI.SPI1_rxd++;
//			SerialSPI.SPI1_txd = SerialSPI.SPI1_rxd;
//			SPI1 -> DR = SerialSPI.SPI1_txd;
//	//		Wait until the data has been transmitted.
//	//		while (!(SPI1->SR & SPI_I2S_FLAG_TXE));
//	//		USART1_print("Transmitting: ");
//	//		USART1_putc(0x40);
//		}
////	//	if(SPI1 -> SR & SPI_I2S_FLAG_RXNE)
////		//	RX: 1- not empty
////	//	if(SPI1 -> SR & 0x0001)
//		if(SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_RXNE) == SET)
//		{
//			SerialSPI.SPI1_flag_rx = 1;
//			SerialSPI.SPI1_rxd = SPI1 -> DR;
//			if(SerialSPI.SPI1_cnt < MAX_STRLEN)
//			{
//				SerialSPI.SPI_received_string[SerialSPI.SPI1_cnt] = SerialSPI.SPI1_rxd;
//				SerialSPI.SPI1_cnt++;
//			}
//			else
//			{
//				memset(SerialSPI.SPI_received_string, 0, sizeof(SerialSPI.SPI_received_string));
//				SerialSPI.SPI1_cnt = 0;
//			}
//		}
//
//	//	if(SPI1 -> SR & 0x0100)
//		if(SPI_I2S_GetITStatus(SPI1, SPI_IT_CRCERR))
//		{
//			SerialSPI.SPI1_flag_err = 1;
//		}
//#else
////	static unsigned short int count = 0, i = 0 ;
////	check if the SPI1 receive interrupt flag was set
////	Slave interrupt
////	TX: 1- empty
////	if(SPI1 -> SR & 0x0002)
//	if(SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_TXE) == SET)
//	{
//		SerialSPI.SPI1_rxd++;
//		SerialSPI.SPI1_txd = SerialSPI.SPI1_rxd;
//		SPI1 -> DR = SerialSPI.SPI1_txd;
////		Wait until the data has been transmitted.
////		while (!(SPI1->SR & SPI_I2S_FLAG_TXE));
////		USART1_print("Transmitting: ");
////		USART1_putc(0x40);
//	}
////	if(SPI1 -> SR & SPI_I2S_FLAG_RXNE)
//	//	RX: 1- not empty
////	if(SPI1 -> SR & 0x0001)
//	if(SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_RXNE) == SET)
//	{
//		SerialSPI.SPI1_flag_rx = 1;
//		SerialSPI.SPI1_rxd = SPI1 -> DR;
//		if(SerialSPI.SPI1_cnt < MAX_STRLEN)
//		{
//			SerialSPI.SPI_received_string[SerialSPI.SPI1_cnt] = SerialSPI.SPI1_rxd;
//			SerialSPI.SPI1_cnt++;
//		}
//		else
//		{
//			memset(SerialSPI.SPI_received_string, 0, sizeof(SerialSPI.SPI_received_string));
//			SerialSPI.SPI1_cnt = 0;
//		}
//	}
//
////	if(SPI1 -> SR & 0x0100)
//	if(SPI_I2S_GetITStatus(SPI1, SPI_IT_CRCERR))
//	{
//		SerialSPI.SPI1_flag_err = 1;
//	}
//#endif
//}
}
/*
 * Interruptions sequence END
 */

//unsigned char rxc;
//unsigned char txcm = 0x4d;	// M
//unsigned char txcs = 0x40;	// @
//	unsigned char txcs = 0x53;	// S

